// Приклад 1
//а
#include <stdio.h>
int main() {
FILE *in; // Опис вказівника на файл
int ch;
if ((in = fopen("proba", "r")) != NULL) { // Відкриття файлу для читання, перевірка чи існує
while ((ch = getc(in)) != EOF) { // Отримання символу із файла
putc(ch, stdout); // Виведення символу в стандартний вивід
}
fclose(in); // Закриття файла
} else {
printf("Файл proba не відкривається \n");}
return 0;}
---------------------------------------------------------------------
// Файл proba не відкривається 

//б
#include <stdio.h>
int main() {
    FILE *ff;
    int base;
    ff = fopen("sam", "r"); // Відкриття файлу для читання
    fscanf(ff, "%d", &base); // Читання значення з файла
    fclose(ff); // Закриття файла
    ff = fopen("data", "a"); // Відкриття файлу для дописування
    fprintf(ff, "sam is %d.\n", base); // Запис значення у файл
    fclose(ff); // Закриття файла
    return 0; } 
---------------------------------------------------------------------
// 

//в
#include <stdio.h>
#define LINE 80
int main() {
    FILE *ff;
    char string[LINE]; // Масив для зберігання рядка
    ff = fopen("opus", "r"); // Відкриття файлу для читання
    while (fgets(string, LINE, ff) != NULL) { // Зчитування рядків з файла
        puts(string); // Виведення рядка на екран
    }
    fclose(ff); // Закриття файла
    return 0;}
---------------------------------------------------------------------
// 

//г
#include <stdlib.h>
#include <stdio.h>
int main() {
    int f1, f2, f3, f4, f5;
    FILE *fp;
    fp = fopen("C:\\temp\\sample.txt", "r"); // Відкриття файлу для читання
    if (fp == NULL) { // Перевірка чи файл відкрито успішно
        printf("Помилка відкриття файлу\n");
        return 1;}
    // Читання з файла
    fscanf(fp, "%d\n%d\n%d\n%d\n%d\n", &f1, &f2, &f3, &f4, &f5);
    printf("Значення: %d, %d, %d, %d, %d\n", f1, f2, f3, f4, f5);
    fclose(fp); // Закриття файла
    return 0;}
---------------------------------------------------------------------
// Помилка відкриття файлу

// Приклад 2
// Функції форматного обміну з файлами fprintf() і fscanf() у мові С дозволяють записувати та зчитувати дані з файлів у відповідності з вказаними форматами, аналогічно функціям printf() і scanf(), які працюють зі стандартним введенням та виведенням.

// Отже, ось їх відмінності:
// fprintf() та fscanf():
// fprintf(): Ця функція використовується для запису даних у файл з використанням заданих форматів. Вона приймає файловий вказівник та список аргументів, аналогічно printf().
// fscanf(): Ця функція використовується для зчитування даних з файлу за заданими форматами. Вона приймає файловий вказівник та список аргументів, аналогічно scanf().

// Відмінності від printf() та scanf():
// printf() та scanf(): Ці функції працюють зі стандартним введенням та виведенням (консоль).
// fprintf() та fscanf(): Ці функції працюють з файлами, що дозволяє записувати та зчитувати дані з файлів.
---------------------------------------------------------------------

// Приклад 3
// Запис файлу
#include <stdio.h>
int main() {
FILE *pf; // Вказівник на файл
int k;
// Відкриття файлу для запису
if ((pf = fopen("proba.txt", "w")) == NULL) { // Перевірка чи відкриття файлу пройшло успішно
perror("proba.txt"); // Виведення повідомлення про помилку
return 1; // Повернення коду помилки
}
// Запис даних у файл
for (k = 0; k <= 5; k++) {
fprintf(pf, "%d %d\n", k, k*k*k*k); // Запис значень у файл
}
fclose(pf); // Закриття файлу
return 0;} 

// Читання даних із файлу proba.txt
#include <stdio.h>
int main() {
FILE *pf; // Вказівник на файл
int n, nn, l;
// Відкриття файлу для читання
if ((pf = fopen("proba.txt", "r")) == NULL) { // Перевірка чи відкриття файлу пройшло успішно
perror("proba.txt"); // Виведення повідомлення про помилку
return 1; } // Повернення коду помилки
}
// Читання даних з файлу
for (l = 0; l <= 5; l++) {
fscanf(pf, "%d %d\n", &n, &nn); } // Зчитування значень з файла
fclose(pf); // Закриття файлу
return 0;} 
---------------------------------------------------------------------
// запис в пейл
// 0 0
// 1 1
// 2 16
// 3 81
// 4 256
// 5 625
// читання
// n = 0, nn = 0
// n = 1, nn = 1
// n = 2, nn = 16
// n = 3, nn = 81
// n = 4, nn = 256
// n = 5, nn = 625

// Приклад 4 Задати 8 змінних цілого типу, записати їх в файл на диску, прочитати їх з файлу в змінні і вивести на екран.
#include <stdio.h>
void main(){
 int num[8]={12,8,4,5,3,8,4,32};
 FILE *pf;
 int i;
 if ((pf = fopen ("num.txt","w")) ==NULL)
 {
    perror("proba.txt");
    return 1; }
 for (i=0; i<8; i++)
    fprintf(pf, "%d\n",num[i]);
    fclose(pf);
    return 0;}

#include <stdio.h> 
void main (void) { 
FILE *pf; 
int a,b;
int n[8]; 
if ((pf = fopen ("num.txt","r"))== NULL) {
perror("proba.txt"); 
return 1; } 
for (b=0; b<8; b++){
 fscanf(pf, "%d\n", &n[b]); } 
fclose(pf); 
for (a=0; a<8; a++){
 printf("%d\n", n[a]); }
return 0;} 
------------------------------------------
// запис
// 12
// 8
// 4
// 5
// 3
// 8
// 4
// 32
// читання
// 12
// 8
// 4
// 5
// 3
// 8
// 4
// 32

